system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

propeller.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    trimFeatures
    {
        minElem         10;
    }
}
rotating.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    trimFeatures
    {
        minElem         10;
    }
}
enclosure.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
    trimFeatures
    {
        minElem         10;
    }
}

// ************************************************************************* //
